; domain
(define (domain wumpus-simple)
  (:requirements :strips :typing)
  
  (:types
    location - object
  )
  
  (:predicates
    (at ?loc - location)              ; agent is at location
    (adjacent ?loc1 ?loc2 - location) ; locations are adjacent
    (has-gold)                        ; agent has the gold
    (gold-at ?loc - location)         ; gold is at location
    (pit-at ?loc - location)          ; pit is at location
    (wumpus-at ?loc - location)       ; wumpus is at location
    (wumpus-dead)                     ; wumpus is dead
    (has-arrow)                       ; agent has arrow
    (safe ?loc - location)            ; location is safe to enter
  )
  
  (:action move
    :parameters (?from ?to - location)
    :precondition (and 
      (at ?from)
      (adjacent ?from ?to)
      (safe ?to)
    )
    :effect (and 
      (not (at ?from))
      (at ?to)
    )
  )
  
  (:action pick-gold
    :parameters (?loc - location)
    :precondition (and 
      (at ?loc)
      (gold-at ?loc)
    )
    :effect (and 
      (has-gold)
      (not (gold-at ?loc))
    )
  )
)

; problem
(define (problem wumpus-simple-problem)
  (:domain wumpus-simple)
  
  (:objects
    loc-1-1 loc-1-2 loc-1-3 loc-1-4
    loc-2-1 loc-2-2 loc-2-3 loc-2-4
    loc-3-1 loc-3-2 loc-3-3 loc-3-4
    loc-4-1 loc-4-2 loc-4-3 loc-4-4 - location
  )
  
  (:init
    ; Agent starts at (1,1)
    (at loc-1-3)
    
    ; Gold location
    (gold-at loc-4-2)
    
    ; Wumpus location
    (wumpus-at loc-1-1)
    
    ; Pit locations
    (pit-at loc-3-1)
    (pit-at loc-3-2)
    (pit-at loc-2-4)
    
    ; Define adjacency relationships for 4x4 grid
    ; Row 1 adjacencies
    (adjacent loc-1-1 loc-1-2) (adjacent loc-1-2 loc-1-1)
    (adjacent loc-1-2 loc-1-3) (adjacent loc-1-3 loc-1-2)
    (adjacent loc-1-3 loc-1-4) (adjacent loc-1-4 loc-1-3)
    (adjacent loc-1-1 loc-2-1) (adjacent loc-2-1 loc-1-1)
    (adjacent loc-1-2 loc-2-2) (adjacent loc-2-2 loc-1-2)
    (adjacent loc-1-3 loc-2-3) (adjacent loc-2-3 loc-1-3)
    (adjacent loc-1-4 loc-2-4) (adjacent loc-2-4 loc-1-4)
    
    ; Row 2 adjacencies
    (adjacent loc-2-1 loc-2-2) (adjacent loc-2-2 loc-2-1)
    (adjacent loc-2-2 loc-2-3) (adjacent loc-2-3 loc-2-2)
    (adjacent loc-2-3 loc-2-4) (adjacent loc-2-4 loc-2-3)
    (adjacent loc-2-1 loc-3-1) (adjacent loc-3-1 loc-2-1)
    (adjacent loc-2-2 loc-3-2) (adjacent loc-3-2 loc-2-2)
    (adjacent loc-2-3 loc-3-3) (adjacent loc-3-3 loc-2-3)
    (adjacent loc-2-4 loc-3-4) (adjacent loc-3-4 loc-2-4)
    
    ; Row 3 adjacencies
    (adjacent loc-3-1 loc-3-2) (adjacent loc-3-2 loc-3-1)
    (adjacent loc-3-2 loc-3-3) (adjacent loc-3-3 loc-3-2)
    (adjacent loc-3-3 loc-3-4) (adjacent loc-3-4 loc-3-3)
    (adjacent loc-3-1 loc-4-1) (adjacent loc-4-1 loc-3-1)
    (adjacent loc-3-2 loc-4-2) (adjacent loc-4-2 loc-3-2)
    (adjacent loc-3-3 loc-4-3) (adjacent loc-4-3 loc-3-3)
    (adjacent loc-3-4 loc-4-4) (adjacent loc-4-4 loc-3-4)
    
    ; Row 4 adjacencies
    (adjacent loc-4-1 loc-4-2) (adjacent loc-4-2 loc-4-1)
    (adjacent loc-4-2 loc-4-3) (adjacent loc-4-3 loc-4-2)
    (adjacent loc-4-3 loc-4-4) (adjacent loc-4-4 loc-4-3)
    
    ; Safe locations (all locations except pits and wumpus location initially)
    (safe loc-1-1) (safe loc-1-2) (safe loc-1-4)
    (safe loc-2-1) (safe loc-2-2) (safe loc-2-3)
    (safe loc-3-3) (safe loc-3-4)
    (safe loc-4-1) (safe loc-4-2) (safe loc-4-3) (safe loc-4-4)
  )
  
  (:goal
    (and 
      (has-gold)
      (at loc-1-1)
    )
  )
)

; plan
1. (move loc-1-3 loc-2-3)
   deleted: (at loc-1-3)
   added: (at loc-2-3)
   goals met: 0 of 2
2. (move loc-2-3 loc-3-3)
   deleted: (at loc-2-3)
   added: (at loc-3-3)
   goals met: 0 of 2
3. (move loc-3-3 loc-4-3)
   deleted: (at loc-3-3)
   added: (at loc-4-3)
   goals met: 0 of 2
4. (move loc-4-3 loc-4-2)
   deleted: (at loc-4-3)
   added: (at loc-4-2)
   goals met: 0 of 2
5. (pick-gold loc-4-2)
   deleted: (gold-at loc-4-2)
   added: (has-gold)
   goals met: 1 of 2
6. (move loc-4-2 loc-4-3)
   deleted: (at loc-4-2)
   added: (at loc-4-3)
   goals met: 1 of 2
7. (move loc-4-3 loc-3-3)
   deleted: (at loc-4-3)
   added: (at loc-3-3)
   goals met: 1 of 2
8. (move loc-3-3 loc-2-3)
   deleted: (at loc-3-3)
   added: (at loc-2-3)
   goals met: 1 of 2
9. (move loc-2-3 loc-2-2)
   deleted: (at loc-2-3)
   added: (at loc-2-2)
   goals met: 1 of 2
10. (move loc-2-2 loc-2-1)
   deleted: (at loc-2-2)
   added: (at loc-2-1)
   goals met: 1 of 2
11. (move loc-2-1 loc-1-1)
   deleted: (at loc-2-1)
   added: (at loc-1-1)
   goals met: 2 of 2
